# ETL Project - The Movie DB

In [1]:
# Import Dependencies
import pandas as pd
from sqlalchemy import create_engine
import os

###  Tranformation of Data ..Continued

In [ ]:
## MOVIES DATAFRAME ##

In [2]:
# Reading smaller version of data file
movie_file_small_cleaned = os.path.join('Resources2','movies_cleaned_small.csv')
movie_small_df_new = pd.read_csv(movie_file_small_cleaned)
movie_small_df_new.head(1)

,id,imdb_id,original_title,release_date,length,status,popularity,original_language,adult,overview,homepage,budget,revenue,genres,imdb_id_new
0,862,tt0114709,Toy Story,1995-10-30,81.0,Released,21.946943,en,False,"Led by Woody, Andy's toys live happily in his ...",http://toystory.disney.com/toy-story,30000000,373554033.0,"Animation, Comedy, Family",114709.0

In [3]:
# Removing column imdb from dataframe
movie_small_df_new = movie_small_df_new.drop(['imdb_id'], axis = 1)
movie_small_df_new  = movie_small_df_new.rename(columns={'imdb_id_new':'imdb_id'})
movie_small_df_new.head(1)

,id,original_title,release_date,length,status,popularity,original_language,adult,overview,homepage,budget,revenue,genres,imdb_id
0,862,Toy Story,1995-10-30,81.0,Released,21.946943,en,False,"Led by Woody, Andy's toys live happily in his ...",http://toystory.disney.com/toy-story,30000000,373554033.0,"Animation, Comedy, Family",114709.0

In [4]:
# Changing datatype of popularity column to integer
movie_small_df_new['popularity'] = movie_small_df_new['popularity'].astype(int)
movie_small_df_new.head(1)

,id,original_title,release_date,length,status,popularity,original_language,adult,overview,homepage,budget,revenue,genres,imdb_id
0,862,Toy Story,1995-10-30,81.0,Released,21,en,False,"Led by Woody, Andy's toys live happily in his ...",http://toystory.disney.com/toy-story,30000000,373554033.0,"Animation, Comedy, Family",114709.0

In [5]:
# Changing datatype of revenue column to integer
movie_small_df_new['revenue'] = movie_small_df_new['revenue'].astype(int)
movie_small_df_new.head(1)

,id,original_title,release_date,length,status,popularity,original_language,adult,overview,homepage,budget,revenue,genres,imdb_id
0,862,Toy Story,1995-10-30,81.0,Released,21,en,False,"Led by Woody, Andy's toys live happily in his ...",http://toystory.disney.com/toy-story,30000000,373554033,"Animation, Comedy, Family",114709.0

In [6]:
# Removing duplicates records from dataframe
movie_small_df_new = movie_small_df_new.drop_duplicates(subset ="id", keep = False)

In [14]:
movie_small_df_new['imdb_id'] = pd.to_numeric(movie_small_df_new['imdb_id'])

In [15]:
movie_small_df_new['imdb_id'].dtype

dtype('float64')

In [17]:
movie_small_df_new.head(1)

,id,original_title,release_date,length,status,popularity,original_language,adult,overview,homepage,budget,revenue,genres,imdb_id
0,862,Toy Story,1995-10-30,81.0,Released,21,en,False,"Led by Woody, Andy's toys live happily in his ...",http://toystory.disney.com/toy-story,30000000,373554033,"Animation, Comedy, Family",114709.0

In [18]:
movie_small_df_new['imdb_id_2'] = ''

In [19]:
movie_small_df_new.head(1)

,id,original_title,release_date,length,status,popularity,original_language,adult,overview,homepage,budget,revenue,genres,imdb_id,imdb_id_2
0,862,Toy Story,1995-10-30,81.0,Released,21,en,False,"Led by Woody, Andy's toys live happily in his ...",http://toystory.disney.com/toy-story,30000000,373554033,"Animation, Comedy, Family",114709.0,

In [25]:
# replacing nan values 
movie_small_df_new['imdb_id_2'].fillna(0, inplace = True)

In [26]:
movie_small_df_new['imdb_id_2'] = movie_small_df_new['imdb_id_2'].astype(int)

In [29]:
movie_small_df_new.head(1)

,id,original_title,release_date,length,status,popularity,original_language,adult,overview,homepage,budget,revenue,genres,imdb_id,imdb_id_2
0,862,Toy Story,1995-10-30,81.0,Released,21,en,False,"Led by Woody, Andy's toys live happily in his ...",http://toystory.disney.com/toy-story,30000000,373554033,"Animation, Comedy, Family",114709.0,114709

In [30]:
# Removing column imdb_id and renaming it from dataframe
movie_small_df_new = movie_small_df_new.drop(['imdb_id'], axis = 1)
movie_small_df_new  = movie_small_df_new.rename(columns={'imdb_id_2':'imdb_id'})
movie_small_df_new.head(1)

,id,original_title,release_date,length,status,popularity,original_language,adult,overview,homepage,budget,revenue,genres,imdb_id
0,862,Toy Story,1995-10-30,81.0,Released,21,en,False,"Led by Woody, Andy's toys live happily in his ...",http://toystory.disney.com/toy-story,30000000,373554033,"Animation, Comedy, Family",114709

In [31]:
# Saving updated dataframe to another csv file
movie_small_df_new.to_csv('Resources2/movies_cleaned_small_final.csv', header=True, index=False)

In [ ]:
'''READING CLEANED & TRANSFORMED DATA FROM CSV FILES'''

In [ ]:
## MOVIES DATAFRAME ##

In [57]:
# Reading smaller version of data file
movie_file = os.path.join('Resources2','movies_cleaned_small_final.csv')
movie_small_df_new = pd.read_csv(movie_file)
movie_small_df_new.head(1)

,id,original_title,release_date,length,status,popularity,original_language,adult,overview,homepage,budget,revenue,genres,imdb_id
0,862,Toy Story,1995-10-30,81.0,Released,21,en,False,"Led by Woody, Andy's toys live happily in his ...",http://toystory.disney.com/toy-story,30000000,373554033,"Animation, Comedy, Family",114709

In [ ]:
## PRODUCTION DATAFRAME ##

In [58]:
# Reading smaller version of data file
productional_file_small = os.path.join('Resources2','production_small.csv')
production_df_new = pd.read_csv(productional_file_small)
production_df_new.head(2)

,id,production_companies,production_countries
0,862,Pixar Animation Studios,United States of America
1,8844,"TriStar Pictures, Teitler Film, Interscope Com...",United States of America

In [ ]:
## CREDITS DATAFRAME ##

In [59]:
# Reading smaller version of data file
credits_file_small = os.path.join('Resources2','credits_small.csv')
credits_df_new = pd.read_csv(credits_file_small)
credits_df_new.head(2)

,id,actors,director,producer
0,862,"Tom Hanks, Tim Allen, Don Rickles, Jim Varney,...",John Lasseter,"Bonnie Arnold, Ralph Guggenheim"
1,8844,"Robin Williams, Jonathan Hyde, Kirsten Dunst, ...",Joe Johnston,"Scott Kroopf, William Teitler"

In [ ]:
## LINKS DATAFRAME ##

In [60]:
# Reading smaller version of data file
links_file_small = os.path.join('Resources2','links_small.csv')
links_df_new = pd.read_csv(links_file_small)
links_df_new.head(2)

   movie_id  imdb_id
0         1   114709
1         2   113497

In [ ]:
## RATINGS DATAFRAME ##

In [61]:
# Reading smaller version of data file
ratings_file_small = os.path.join('Resources2','ratings_small.csv')
ratings_df_new = pd.read_csv(ratings_file_small)
ratings_df_new.head(2)

   movie_id  rating
0       110     1.0
1       147     4.5

### Loading of data into dataframe

In [63]:
# Connection to database
connection_string = "postgres:<password>@localhost:5432/ETL_Project_Movies_DB"
engine = create_engine(f'postgresql://{connection_string}')

In [65]:
# Check for tables
engine.table_names()

['movies', 'ratings', 'credits', 'links', 'production']

In [66]:
## MOVIES TABLE ##

# Use pandas to load csv converted DataFrame into database table
movie_small_df_new.to_sql(name='movies', con=engine, if_exists='append', index=False)

In [67]:
# Confirm data has been added by querying the table
pd.read_sql_query('select * from movies', con=engine).head(2)

,id,original_title,release_date,length,status,popularity,original_language,adult,overview,homepage,budget,revenue,genres,imdb_id
0,862,Toy Story,1995-10-30,81.0,Released,21,en,false,"Led by Woody, Andy's toys live happily in his ...",http://toystory.disney.com/toy-story,30000000,373554033,"Animation, Comedy, Family",114709
1,8844,Jumanji,1995-12-15,104.0,Released,17,en,false,When siblings Judy and Peter discover an encha...,None,65000000,262797249,"Adventure, Fantasy, Family",113497

In [68]:
## PRODUCION TABLE ##

# Use pandas to load csv converted DataFrame into database
production_df_new.to_sql(name='production', con=engine, if_exists='append', index=False)

In [69]:
# Confirm data has been added by querying the table
pd.read_sql_query('select * from production', con=engine).head()

,id,production_companies,production_countries
0,862,Pixar Animation Studios,United States of America
1,8844,"TriStar Pictures, Teitler Film, Interscope Com...",United States of America
2,15602,"Warner Bros., Lancaster Gate",United States of America
3,31357,Twentieth Century Fox Film Corporation,United States of America
4,11862,"Sandollar Productions, Touchstone Pictures",United States of America

In [70]:
## CREDITS TABLE ##

# Use pandas to load csv converted DataFrame into database
credits_df_new.to_sql(name='credits', con=engine, if_exists='append', index=False)

In [71]:
# Confirm data has been added by querying the table
pd.read_sql_query('select * from credits', con=engine).head()

,id,actors,director,producer
0,862,"Tom Hanks, Tim Allen, Don Rickles, Jim Varney,...",John Lasseter,"Bonnie Arnold, Ralph Guggenheim"
1,8844,"Robin Williams, Jonathan Hyde, Kirsten Dunst, ...",Joe Johnston,"Scott Kroopf, William Teitler"
2,15602,"Walter Matthau, Jack Lemmon, Ann-Margret, Soph...",Howard Deutch,None
3,31357,"Whitney Houston, Angela Bassett, Loretta Devin...",Forest Whitaker,"Ronald Bass, Ezra Swerdlow, Deborah Schindler,..."
4,11862,"Steve Martin, Diane Keaton, Martin Short, Kimb...",Charles Shyer,Nancy Meyers

In [72]:
## LINKS TABLE ##

# Use pandas to load csv converted DataFrame into database
links_df_new.to_sql(name='links', con=engine, if_exists='append', index=False)

In [73]:
# Confirm data has been added by querying the table
pd.read_sql_query('select * from links', con=engine).head()

  movie_id imdb_id
0        1  114709
1        2  113497
2        3  113228
3        4  114885
4        5  113041

In [74]:
## RATINGS TABLE ##

# Use pandas to load csv converted DataFrame into database
ratings_df_new.to_sql(name='ratings', con=engine, if_exists='append', index=False)

In [75]:
# Confirm data has been added by querying the table
pd.read_sql_query('select * from ratings', con=engine).head()

  movie_id  rating
0      110       1
1      147       5
2      858       5
3     1221       5
4     1246       5